Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32)
Sets the number of tab stops that the paragraph should be indented.
Remarks:
The indent level is the number of tab stops by which each paragraph will be indented.
Note that adjoining paragraphs that have the same indent level
and have a list type other than Autodesk.Revit.DB.ListType.None
are considered part of a numbered list.
Changing the indent level of paragraphs that are bulleted or numbered
(i.e. paragraphs that have a  list type other than Autodesk.Revit.DB.ListType.None)
may cause other changes to the document as the changed paragraphs
may join or leave a list.  Which will cause the other paragraphs in those lists
to be renumbered.
This function applies the nesting level to all paragraphs contained in the given range.
The level set on the paragraph cannot be negative and cannot be larger than the value returned by
Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel .
textRange:
The given text range.
level:
The level set on the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This level is too large to set on a paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for level is negative.
Since:
2017

Autodesk.Revit.DB.FormattedText.GetIndentLevel(Autodesk.Revit.DB.TextRange)
Returns the indent level of the paragraphs in the text range.
Remarks:
Returns -1 if the range contains multiple paragraphs with different indent levels.
textRange:
The given text range.
Returns:
The indentation level of the paragraphs in the range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetListStartNumber(Autodesk.Revit.DB.TextRange,System.Int32)
Sets the list start number on the paragraphs in a given text range.
Remarks:
List start number is the number of the first paragraph in a numbered list.
List start number can be set on paragraphs of type Autodesk.Revit.DB.ListType.ArabicNumbers,
Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters.
List start number can only be set for top-level paragraphs in a list;
that is, they cannot be set to paragraphs which are part of a sub-list.
For paragraphs of type Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters
the list start number represents the letter in the order it appears in the alphabet.
For example, for paragraphs of type Autodesk.Revit.DB.ListType.LowerCaseLetters,
list start number of 2 will result in a list start "b.";
list start number of 27 will result in a list start "aa.".
Adjoining paragraphs which have a list type other than Autodesk.Revit.DB.ListType.None
are considered part of a numbered list.
Changing the list start number of numbered paragraphs
will cause changes to the numbers of the rest of the paragraphs in the same list.
This function applies the list start number to the given range.
The list start number must be in the range given by the methods
Autodesk.Revit.DB.FormattedText.GetMinimumListStartNumber and
Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber.
textRange:
The given text range.
value:
The list start number to be set on the text range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This list start number is not valid.
A valid value must be in the range given by the methods
Autodesk.Revit.DB.FormattedText.GetMinimumListStartNumber and
Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber.
-or-
Cannot set list start number on this text range. The range contains paragraphs on which list start number cannot be set.
List start number can be set on pararaphs of type Autodesk.Revit.DB.ListType.ArabicNumbers,
Autodesk.Revit.DB.ListType.LowerCaseLetters and Autodesk.Revit.DB.ListType.UpperCaseLetters.
List start number can only be set for top-level paragraphs in a list;
that is, they cannot be set to paragraphs which are part of a sub-list.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetListStartNumber(Autodesk.Revit.DB.TextRange)
Returns the list start number of the paragraphs in a given text range.
Remarks:
Returns -1 if there is a mix of list start values in the range or
if there are paragraphs in different lists or sub-lists in the range or
if there are paragraphs of type Autodesk.Revit.DB.ListType.None or Autodesk.Revit.DB.ListType.Bullet in the range.
textRange:
The given text range.
Returns:
The list start number of the text range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetListType(Autodesk.Revit.DB.TextRange,Autodesk.Revit.DB.ListType)
Sets the Autodesk.Revit.DB.ListType of a paragraph.
Remarks:
This function applies the Autodesk.Revit.DB.ListType
to all paragraphs contained in the given range.
The following Autodesk.Revit.DB.ListType options are available:
Autodesk.Revit.DB.ListType.BulletAutodesk.Revit.DB.ListType.ArabicNumbersAutodesk.Revit.DB.ListType.LowerCaseLettersAutodesk.Revit.DB.ListType.UpperCaseLetters
Set the list type to Autodesk.Revit.DB.ListType.None
if the paragraph should not be in a list.
The list type cannot be set to Autodesk.Revit.DB.ListType.Mixed.
Paragraphs with a Autodesk.Revit.DB.ListType other than Autodesk.Revit.DB.ListType.None are considered
to be 'list' paragraphs.
Consecutive list paragraphs with the same indentation level are treated as part of the same list.
A list ends when a list paragraph is followed by
a paragraph that has Autodesk.Revit.DB.ListType.Noneor a list paragraph that has a lower indentation level, (i.e. is indented less)
Note that a list will continue uninterrupted after list paragraphs that have higher indentation level.
These paragraphs are considered a 'sub-list'.
Using Autodesk.Revit.DB.FormattedText.SetIndentLevel(Autodesk.Revit.DB.TextRange,System.Int32) it is therefore possible to create multi-level lists.
Note that sub-lists can have their own sub-sub-lists.
The nesting level is only limited by the maximum indent level.
FormattedText will keep lists consistent.
That means that numbered paragraphs will automatically get sequential numbers or letters.
It also means that if the list type of one paragraphs in the list
is changed then that change is propagated to all the paragraphs in that list.
Even if those paragraphs were not in the input text range.
Note that this will not affect the list type of any nested sub-lists.
Use a vertical tab character ('\v') to insert a line without a bullet or number.
Since this does not end the paragraph this will allow the list to continue to the next paragraph.
textRange:
The given text range.
listType:
The Autodesk.Revit.DB.ListType to set on the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
This list type is not valid to set on a paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.FormattedText.GetListType(Autodesk.Revit.DB.TextRange)
Returns the Autodesk.Revit.DB.ListType of a paragraph.
Remarks:
This function returns the list type of all paragraphs contained in the given range.
Returns Autodesk.Revit.DB.ListType.None if the paragraph is not in a list.
Returns Autodesk.Revit.DB.ListType.Mixed if the list types don't match between the paragraphs.
textRange:
The given text range.
Returns:
The Autodesk.Revit.DB.ListType of the paragraph.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetAllCapsStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be in all caps or not.
Remarks:
Removing the all caps status will revert the characters back to their
original case.  It will not make them lower case.
The given text range should not be empty.
textRange:
The given text range.
isAllCaps:
The desired all caps status of characters in the given text range.
True will render all characters in all caps.
False will revert the characters back to their original mixed case.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSuperscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be superscript or not superscript.
Remarks:
Superscript and subscript are mutually exclusive.
Applying the superscript status will automatically remove the subscript status.
The given text range should not be empty.
textRange:
The given text range.
isSuperscript:
The desired superscript status of characters in the given text range.
True to set superscript, false to set not superscript.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetSubscriptStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be subscript or not subscript.
Remarks:
Superscript and subscript are mutually exclusive.
Applying the subscript status will automatically remove the superscript status.
The given text range should not be empty.
textRange:
The given text range.
isSubscript:
The desired subscript status of characters in the given text range.
True to set subscript, false to set not subscript.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetUnderlineStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be underlined or not underlined.
Remarks:
Bullets, numbers, or letters of a list can not be underlined.
The given text range should not be empty.
textRange:
The given text range.
isUnderlined:
The desired underline status of characters in the given text range.
True to set underlined, false to set not underlined.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetItalicStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be italic or not italic.
Remarks:
To make the numbers or letters in a list italic, apply the italic status to
the carriage return character that ends the list paragraph.
The given text range should not be empty.
textRange:
The given text range.
isItalic:
The desired italic status of characters in the given text range.
True to set italic, false to set not italic.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetBoldStatus(Autodesk.Revit.DB.TextRange,System.Boolean)
Sets the characters in a given text range to be bold or not bold.
Remarks:
To make the numbers or letters in a list bold, apply the bold status to
the carriage return character that ends the list paragraph.
The given text range should not be empty.
textRange:
The given text range.
isBold:
The desired bold status of characters in the given text range.
True to set bold, false to set not bold.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetAllCapsStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are in all caps.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of all caps on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSuperscriptStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are superscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of superscript on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetSubscriptStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are subscripted.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of subscript on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetUnderlineStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are underlined.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of underline on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetItalicStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are italic.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of italic on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetBoldStatus(Autodesk.Revit.DB.TextRange)
Returns whether Autodesk.Revit.DB.FormatStatus.All, Autodesk.Revit.DB.FormatStatus.None or a Autodesk.Revit.DB.FormatStatus.Mixed set of characters in a given text range are bold.
Remarks:
This function only returns Autodesk.Revit.DB.FormatStatus.All or Autodesk.Revit.DB.FormatStatus.None if the text contains one character.
The given text range should not be empty.
textRange:
The given text range.
Returns:
The format status of bold on characters Autodesk.Revit.DB.FormatStatus.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This text range is empty.
-or-
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetPlainText(Autodesk.Revit.DB.TextRange,System.String)
Sets the text with the given text in a plain text form in a range.
Remarks:
Any individual formatting present in the range before will be lost after applying this function
and the text in the range will have uniform formatting.
The given text will be inserted if the given text range is empty.
The given text should have no more than 30,000 characters.
The the resulting text may not exceed 30,000 characters.
Newline characters ('\n') are not allowed.
textRange:
The given text range.
plainText:
The given text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
-or-
plainText contains invalid characters such as a newline character.
-or-
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
Replacing the text in textRange with plainText will exceed 30,000 characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.SetPlainText(System.String)
Sets the entire text with the given text in a plain text form.
Remarks:
Any individual formatting present before will be lost after applying this function
and the text will have uniform formatting.
If the text does not end with a carriage return character ('\r') one will be added.
An empty string is allowed.
The given text should have no more than 30,000 characters, not counting a terminating carriage return  character ('\r').
Newline characters ('\n') are not allowed.
plainText:
The given text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
plainText contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.GetPlainText(Autodesk.Revit.DB.TextRange)
Returns a substring of the text in a plain text form. The start and end of the substring is identified
by a given Autodesk.Revit.DB.TextRange.
textRange:
The given Autodesk.Revit.DB.TextRange.
Returns:
The substring of the text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This start index of this text range is not within the text range identifying the entire text.
-or-
The end of this text range is not within the text range identifying the entire text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FormattedText.Find(System.String,System.Int32,System.Boolean,System.Boolean)
Returns a text range identifying the first occurrence of the given string within the text,
starting from a given index.
Remarks:
Returns an empty text range:
if the given string cannot be found in the text.if the given start index is beyond the length of the entire text.
The search can be case-sensitive or case-insensitive.
The search can be set to match whole words or part of words.
searchString:
The text to search for.
startIndex:
The start index to search within the text.
matchCase:
True if the case must match when searching the formatted text, false to search in a case-insensitive manner.
matchWholeWord:
True if the match must be a whole word when searching the formatted text, false otherwise.
Returns:
The text range identified.
Throws Autodesk.Revit.Exceptions.ArgumentException:
searchString is an empty string.
-or-
searchString contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for startIndex is negative.
Since:
2017

Autodesk.Revit.DB.FormattedText.#ctor(System.String)
Creates a new FormattedText object with unformatted text.
Remarks:
The given text should have no more than 30,000 characters.
Line feed characters ('/n') are not allowed.
An empty string is allowed.
plainText:
The text in a plain text form.
Throws Autodesk.Revit.Exceptions.ArgumentException:
plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters.
-or-
plainText contains invalid characters such as a newline character.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017